#include "kbn_print_banner.h"

void print_banner()
{
    printf("\n__   __           _                         _ _   _ _       "
           "_\n| | / /          | |                       | | \\ | (_)     "
           "(_)      \n| |/ /  ___ _   _| |__   ___   __ _ _ __ __| |  \\| "
           "|_ "
           "_ __  _  __ _ \n|    \\ / _ \\ | | | '_ \\ / _ \\ / _` | '__/ _` "
           "| . "
           "` | | '_ \\| |/ _` |\n| |\\  \\  __/ |_| | |_) | (_) | (_| | | | "
           "(_| | |\\  | | | | | | (_| |\n\\_| \\_/\\___|\\__, |_.__/ \\___/ "
           "\\__,_|_|  \\__,_\\_| \\_/_|_| |_| |\\__,_|\n             __/ |  "
           "     "
           "                                 _/ |      \n            |___/   "
           "                                     |__/ \n");
    printf("             *******************************************\n"
           "            * Вас приветствует программа KeyboardNinja! *\n"
           "             *******************************************\n");
    printf("\n");
}

void learn_settings(int* language, int* comlexity)
{
    printf("       ***Введите цифру соответственно выбранному Вами языка***\n"
           "                 1 - Русский язык (Russian)\n"
           "                 2 - Английский язык (English)\n: ");
    scanf("%d", language);
    printf("    ***Введите желаемый уровень сложности соответственно "
           "цифре***\n"
           "                    1 - Легкий\n"
           "                    2 - Средний\n"
           "                    3 - Сложный\n: ");
    scanf("%d", comlexity);
}